Revit 2026 API

# FilteredWorksetCollectorOfKind Method

---

Applies a WorksetKindFilter to the collector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredWorksetCollector OfKind(
	WorksetKind worksetKind
)
```
```vb
Public Function OfKind (
	worksetKind As WorksetKind
) As FilteredWorksetCollector
```
```cpp
public:
FilteredWorksetCollector^ OfKind(
	WorksetKind worksetKind
)
```
```fsharp
member OfKind :
        worksetKind : WorksetKind -> FilteredWorksetCollector
```

#### Parameters

worksetKind WorksetKind
     The WorksetKind of the workset.

#### Return Value

FilteredWorksetCollector A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Only worksets whose WorksetKind is an exact match to the input WorksetKind will pass the collector.

If you have an active iterator to this collector it will be stopped by this call.

#### Reference

FilteredWorksetCollector Class

Autodesk.Revit.DB Namespace